XiuruiFu/STC_B-STC15F2K60S2-spacewar/source/main.c
#include "STC15F2K60S2.H"
#include "sys.H"
#include "displayer.H"
#include "key.H"
#include "adc.H"
#include "beep.H"
#include "uart1.H"
#include "uart2.H"
#include "DS1302.H"
#include "sin_table.h"
#include "config.h"
#include <math.h>   /* sqrt(引力方向归一化用) */
#include "IR.h"     /* 彩蛋红外接收 */

code unsigned long SysClock = 11059200;   // 11.0592MHz

#ifdef _displayer_H_
code char decode_table[] = {0x3f,0x06,0x5b,0x4f,0x66,0x6d,0x7d,0x07,0x7f,0x6f,0x00,0x08,0x40,0x01, 0x41, 0x48,
                            0x3f|0x80,0x06|0x80,0x5b|0x80,0x4f|0x80,0x66|0x80,0x6d|0x80,0x7d|0x80,0x07|0x80,0x7f|0x80,0x6f|0x80};
#endif

/* ================= 通信帧头 ================= */
#define HEAD_PC0    0xAA
#define HEAD_PC1    0x55
#define HEAD_SLV0   0xA5
#define HEAD_SLV1   0x5A

/* 彩蛋魔数(红外) */
#define EASTER_MAGIC 0xE1

/* Host->PC 状态帧布局, 全部由 BULLET_MAX / BOSS_BULLET_MAX 推导(避免改配置时帧错位):
 * 帧头2 + state/menuSel2 + 双方飞船8 + 玩家子弹(2*BULLET_MAX*3) + 胜场2 + flags1 + bgMode1 + easterEgg1
 * + BOSS血量1 + BOSS子弹(BOSS_BULLET_MAX*3) + 校验和1 */
#define FRAME_BULLET_BASE  12
#define FRAME_BULLET_BYTES (BULLET_MAX * 3)
#define FRAME_P1WINS       (FRAME_BULLET_BASE + 2 * FRAME_BULLET_BYTES)
#define FRAME_P2WINS       (FRAME_P1WINS + 1)
#define FRAME_FLAGS        (FRAME_P2WINS + 1)
#define FRAME_BGMODE       (FRAME_FLAGS + 1)
#define FRAME_EASTER       (FRAME_BGMODE + 1)
#define FRAME_BOSS_HP      (FRAME_EASTER + 1)
#define FRAME_BOSS_BSTART  (FRAME_BOSS_HP + 1)
#define FRAME_BOSS_BYTES   (BOSS_BULLET_MAX * 3)
#define FRAME_TX_LEN       (FRAME_BOSS_BSTART + FRAME_BOSS_BYTES + 1)   /* +1 校验和 */

/* 昼夜背景模式 */
#define BG_NIGHT  0
#define BG_DAY    1

/* 胜者 flags 位(扩展, 原 0x01/0x02=死亡特效, 0x04/0x08=P1/P2胜) */
#define FLAG_BOSS_WIN   0x10   /* 合作战 BOSS 被击毁, 双方胜 */
#define FLAG_BOSS_LOSE  0x20   /* 合作战双方出局, 失败 */

/* ================= 状态机 ================= */
#define ST_MENU     0
#define ST_PLAYING  1
#define ST_GAMEOVER 2
#define ST_EXITED   3

/* ================= 按键掩码位 ================= */
#define K_FWD   0x01
#define K_BACK  0x02
#define K_FIRE  0x04
#define K_LEFT  0x08
#define K_RIGHT 0x10
#define K_MENUUP    0x20   /* 菜单上移 (NavLeft) */
#define K_MENUDOWN  0x40   /* 菜单下移 (NavRight) */

/* ================= 飞船结构 ================= */
typedef struct {
    float x, y;
    float vx, vy;
    unsigned char ang;
    unsigned char lives;
    unsigned char respawn;   /* 重生倒计时, 0=在场 */
    unsigned char active;    /* 1=在场可见 */
} Ship;

/* ================= 子弹结构 ================= */
typedef struct {
    unsigned char active;
    float x, y;
    float vx, vy;
    unsigned int life;
} Bullet;

/* ================= 全局状态 ================= */
xdata Ship ship1, ship2;
xdata Bullet bullet1[BULLET_MAX], bullet2[BULLET_MAX];
xdata Bullet boss_bullets[BOSS_BULLET_MAX];

xdata unsigned char g_state;       /* 状态机 */
xdata unsigned char g_menuSel;     /* 菜单选中项 */
xdata unsigned char p1_keys;       /* P1 按住状态掩码 */
xdata unsigned char p2_keys;       /* P2 按住状态掩码 */
xdata unsigned char p2_keys_prev;  /* P2 上一帧掩码(用于开火边沿) */
xdata unsigned char p1_fire_edge;  /* P1 开火边沿标志 */
xdata unsigned char p1wins, p2wins;
xdata unsigned char g_flags;       /* bit0/1 爆炸特效, bit2/3 胜者, bit4/5 BOSS 胜负 */
xdata unsigned char g_bgMode;      /* 背景模式: BG_NIGHT/BG_DAY (开始游戏瞬间由光敏判定) */
xdata unsigned char g_easterArmed; /* 彩蛋已武装(红外触发, 开局消耗) */
xdata unsigned char g_easterEgg;   /* 本局彩蛋地图标志(0/1) */
xdata unsigned char g_bossHp;      /* BOSS 剩余血量 */
xdata unsigned char g_bossAlive;   /* BOSS 是否在场 (1=在场) */
xdata unsigned int  g_bossFireTick;/* BOSS 射击倒计时 */
xdata unsigned char g_bossFireAng; /* BOSS 散射基准角(256制) */
xdata unsigned char g_led_run;     /* 彩蛋武装流水灯位(菜单态) */
xdata unsigned char gameover_tick; /* GAMEOVER 停留计时 */
xdata unsigned char exit_tick;     /* EXITED 停留计时 */
xdata unsigned int  rs485_timeout; /* RS485 接收超时计数 */

xdata unsigned char uart2_rx[4];   /* Slave 按键帧接收缓冲 */
xdata unsigned char uart1_tx[FRAME_TX_LEN];  /* Host->PC 发送缓冲(须全局, 异步发送期间不覆盖) */
xdata unsigned char ir_rx[1];      /* 彩蛋红外接收缓冲 */
code  unsigned char slv_head[2] = {HEAD_SLV0, HEAD_SLV1};

/* ================= 随机数 (简单 LCG) ================= */
xdata unsigned int rnd_seed;
unsigned int rnd(void) {
    rnd_seed = rnd_seed * 1103515245u + 12345u;
    return (rnd_seed >> 8) & 0xFFFF;
}

/* ================= 子弹工具 ================= */
void clear_bullets(Bullet *arr) {
    unsigned char i;
    for (i = 0; i < BULLET_MAX; i++) arr[i].active = 0;
}

void clear_boss_bullets(void) {
    unsigned char i;
    for (i = 0; i < BOSS_BULLET_MAX; i++) boss_bullets[i].active = 0;
}

/* ================= 菜单导航 ================= */
void menu_move(signed char dir) {
    signed char s = (signed char)g_menuSel + dir;
    if (s < 0) s = 2;
    if (s > 2) s = 0;
    g_menuSel = (unsigned char)s;
}

void menu_confirm(void) {
    struct_ADC adc_val;
    switch (g_menuSel) {
        case 0: /* 进入游戏 -> 重置并开战 */
            /* 开始游戏瞬间按当前亮度判定昼夜背景(游戏过程中亮度变化不影响) */
            adc_val = GetADC();
            g_bgMode = (adc_val.Rop > LIGHT_THRESHOLD) ? BG_DAY : BG_NIGHT;
            /* 彩蛋武装则本局进入彩蛋地图并消耗(一次性) */
            g_easterEgg = g_easterArmed;
            g_easterArmed = 0;
            /* 彩蛋地图重置 BOSS(普通局无 BOSS) */
            g_bossHp = BOSS_HP;
            g_bossAlive = g_easterEgg;
            g_bossFireTick = BOSS_FIRE_INTERVAL;
            g_bossFireAng = 0;
            clear_boss_bullets();
            ship1.x = 64;  ship1.y = 128; ship1.vx = 0; ship1.vy = 0;
            ship1.ang = 0; ship1.lives = LIVES_MAX; ship1.respawn = 0; ship1.active = 1;
            ship2.x = 192; ship2.y = 128; ship2.vx = 0; ship2.vy = 0;
            ship2.ang = 128; ship2.lives = LIVES_MAX; ship2.respawn = 0; ship2.active = 1;
            clear_bullets(bullet1);
            clear_bullets(bullet2);
            g_flags = 0;
            g_state = ST_PLAYING;
            SetBeep(800, 8);
            break;
        case 1: /* 总胜场清零 */
            p1wins = 0; p2wins = 0;
            NVM_Write(0, 0);
            NVM_Write(1, 0);
            NVM_Write(2, 0x5A);
            SetBeep(1000, 8);
            break;
        case 2: /* 退出游戏 */
            g_state = ST_EXITED;
            exit_tick = 100;  /* 1 秒后自动回菜单(PC 已自行退出) */
            SetBeep(400, 10);
            break;
    }
}

/* ================= 重生 ================= */
float dist2_wrap(float x1, float y1, float x2, float y2);  /* 前置声明(定义在后) */

void respawn_ship(Ship *s) {
    unsigned char tries;
    /* 随机位置，但须避开黑洞吞噬半径(黑洞半径+飞船半径)，否则一重生即被吞噬 */
    for (tries = 0; tries < 16; tries++) {
        s->x = (float)(rnd() & 0xFF);
        s->y = (float)(rnd() & 0xFF);
        if (dist2_wrap(s->x, s->y, (float)BH_X, (float)BH_Y) >= (float)(BH_R + SHIP_R) * (BH_R + SHIP_R))
            break;
    }
    s->vx = 0.0f; s->vy = 0.0f;
    s->ang = (unsigned char)(rnd() & 0xFF);
    s->respawn = 0;
    s->active = 1;
    /* 清除对应玩家的爆炸特效标志 */
    if (s == &ship1) g_flags &= ~0x01;
    if (s == &ship2) g_flags &= ~0x02;
}

/* ================= 发射子弹 ================= */
void fire_bullet(Ship *s, Bullet *b) {
    float dirx, diry;
    unsigned char idx;
    idx = (unsigned char)(s->ang + 64);
    dirx = sin_table[idx];
    diry = -sin_table[s->ang];
    b->x = s->x + dirx * (float)(SHIP_R + 2);
    b->y = s->y + diry * (float)(SHIP_R + 2);
    b->vx = s->vx + dirx * BULLET_SPEED;
    b->vy = s->vy + diry * BULLET_SPEED;
    b->life = BULLET_LIFE;
    b->active = 1;
}

void try_fire(Ship *s, Bullet *arr) {
    unsigned char i;
    if (s->active == 0) return;
    for (i = 0; i < BULLET_MAX; i++) {
        if (arr[i].active == 0) { fire_bullet(s, &arr[i]); return; }
    }
}

/* ================= 环绕边界 ================= */
float wrap_coord(float v) {
    if (v >= (float)FIELD) v -= (float)FIELD;
    if (v < 0.0f) v += (float)FIELD;
    return v;
}

/* ================= 距离平方(考虑环绕最近距离) ================= */
float dist2_wrap(float x1, float y1, float x2, float y2) {
    float dx, dy;
    dx = x1 - x2; if (dx < 0) dx = -dx;
    dy = y1 - y2; if (dy < 0) dy = -dy;
    if (dx > (float)(FIELD/2)) dx = (float)FIELD - dx;
    if (dy > (float)(FIELD/2)) dy = (float)FIELD - dy;
    return dx*dx + dy*dy;
}

/* ================= 飞船死亡 ================= */
void kill_ship(unsigned char player) {
    Ship *s;
    Bullet *barray;
    if (player == 0) { s = &ship1; barray = bullet1; }
    else             { s = &ship2; barray = bullet2; }
    if (s->active == 0) return;
    s->lives--;
    clear_bullets(barray);
    s->active = 0;
    s->respawn = RESPAWN_TICKS;
    g_flags |= (player == 0) ? 0x01 : 0x02;   /* 爆炸特效 */
    SetBeep(200, 15);
}

