XiuruiFu/STC_B-STC15F2K60S2-spacewar/source/main.c
/* ================= 更新飞船 ================= */
void update_ship(Ship *s, unsigned char keys) {
    float dirx, diry, gx, gy, r, r2, f;
    unsigned char idx;
    if (s->active == 0) {
        if (s->respawn > 0) {
            s->respawn--;
            if (s->respawn == 0 && s->lives > 0) respawn_ship(s);
        }
        return;
    }
    /* 旋转 */
    if (keys & K_LEFT)  s->ang += ROT_SPEED;
    if (keys & K_RIGHT) s->ang -= ROT_SPEED;
    /* 推力 */
    if (keys & (K_FWD | K_BACK)) {
        idx = (unsigned char)(s->ang + 64);
        dirx = sin_table[idx];
        diry = -sin_table[s->ang];
        if (keys & K_FWD)  { s->vx += dirx * THRUST; s->vy += diry * THRUST; }
        if (keys & K_BACK) { s->vx -= dirx * THRUST; s->vy -= diry * THRUST; }
    }
    /* 引力/斥力 (合作战 BOSS 无引力; 普通局洞在中心, 普通欧氏方向即可, 环绕分支不生效):
     * 力大小 F = GRAVITY / max(r², GRAVITY_MIN_R²); 仅影响飞船, 受 MAX_SPEED 钳制 */
    if (!g_easterEgg) {
        gx = (float)BH_X - s->x;   /* 飞船->洞 向量 */
        gy = (float)BH_Y - s->y;
        r2 = gx*gx + gy*gy;
        if (r2 >= (float)(GRAVITY_MIN_R * GRAVITY_MIN_R)) r = sqrt(r2);
        else r = (float)GRAVITY_MIN_R;
        f = GRAVITY / (r * r);
        if (g_bgMode == BG_DAY) {
            /* 白洞斥力: 方向 = 洞->飞船 = (-gx, -gy) */
            s->vx -= f * gx / r;
            s->vy -= f * gy / r;
        } else {
            /* 黑洞引力: 方向 = 飞船->洞 = (gx, gy) */
            s->vx += f * gx / r;
            s->vy += f * gy / r;
        }
    }
    /* 限速 */
    if (s->vx > MAX_SPEED) s->vx = MAX_SPEED;
    if (s->vx < -MAX_SPEED) s->vx = -MAX_SPEED;
    if (s->vy > MAX_SPEED) s->vy = MAX_SPEED;
    if (s->vy < -MAX_SPEED) s->vy = -MAX_SPEED;
    /* 积分 */
    s->x += s->vx;
    s->y += s->vy;
    s->x = wrap_coord(s->x);
    s->y = wrap_coord(s->y);
}

/* ================= 更新子弹 ================= */
void update_bullet(Bullet *b) {
    if (b->active == 0) return;
    b->x += b->vx;
    b->y += b->vy;
    b->x = wrap_coord(b->x);
    b->y = wrap_coord(b->y);
    if (b->life > 0) b->life--;
    else b->active = 0;
}

void update_bullets(Bullet *arr) {
    unsigned char i;
    for (i = 0; i < BULLET_MAX; i++) update_bullet(&arr[i]);
}

void update_boss_bullets(void) {
    unsigned char i;
    for (i = 0; i < BOSS_BULLET_MAX; i++) update_bullet(&boss_bullets[i]);
}

/* ================= BOSS ================= */
void boss_fire(void) {
    unsigned char i, fired, ang;
    fired = 0;
    for (i = 0; i < BOSS_BULLET_MAX && fired < BOSS_FIRE_COUNT; i++) {
        if (boss_bullets[i].active) continue;
        ang = (unsigned char)(g_bossFireAng + fired * (256 / BOSS_FIRE_COUNT));
        boss_bullets[i].vx = sin_table[(unsigned char)(ang + 64)] * BOSS_BULLET_SPEED;
        boss_bullets[i].vy = -sin_table[ang] * BOSS_BULLET_SPEED;
        boss_bullets[i].x = (float)BH_X + boss_bullets[i].vx * (float)(BH_R + BOSS_BULLET_R);
        boss_bullets[i].y = (float)BH_Y + boss_bullets[i].vy * (float)(BH_R + BOSS_BULLET_R);
        boss_bullets[i].life = BOSS_BULLET_LIFE;
        boss_bullets[i].active = 1;
        fired++;
    }
    g_bossFireAng = (unsigned char)(g_bossFireAng + BOSS_FIRE_ROT);
}

/* 反击弹: 朝目标飞船当前位置射 1 发(复用 BOSS 子弹池, 无空位则不发射) */
void boss_retaliate(Ship *target) {
    float dx, dy, len;
    unsigned char i;
    for (i = 0; i < BOSS_BULLET_MAX; i++) {
        if (boss_bullets[i].active) continue;
        dx = target->x - (float)BH_X;
        dy = target->y - (float)BH_Y;
        len = sqrt(dx * dx + dy * dy);
        if (len < 0.5f) { dx = 1.0f; dy = 0.0f; len = 1.0f; }
        boss_bullets[i].vx = dx / len * BOSS_BULLET_SPEED;
        boss_bullets[i].vy = dy / len * BOSS_BULLET_SPEED;
        boss_bullets[i].x = (float)BH_X + boss_bullets[i].vx * (float)(BH_R + BOSS_BULLET_R);
        boss_bullets[i].y = (float)BH_Y + boss_bullets[i].vy * (float)(BH_R + BOSS_BULLET_R);
        boss_bullets[i].life = BOSS_BULLET_LIFE;
        boss_bullets[i].active = 1;
        return;
    }
}

/* 玩家子弹命中 BOSS: 扣 1 血, 并向该飞船当前位置反击 1 发 */
void boss_damage(unsigned char player) {
    if (g_bossAlive == 0) return;
    if (g_bossHp > 0) g_bossHp--;
    boss_retaliate(player == 0 ? &ship1 : &ship2);
    if (g_bossHp == 0) {
        g_bossAlive = 0;
        g_flags |= FLAG_BOSS_WIN;
        g_state = ST_GAMEOVER;
        gameover_tick = 200;
        clear_boss_bullets();
        SetBeep(500, 30);
    }
}

/* ================= 碰撞检测 ================= */
void check_collisions_boss(void) {
    float ship_r2, bullet_r2;
    unsigned char i;
    ship_r2 = (float)(BH_R + SHIP_R) * (BH_R + SHIP_R);
    /* 飞船撞 BOSS 即死 */
    if (g_bossAlive) {
        if (ship1.active && dist2_wrap(ship1.x, ship1.y, (float)BH_X, (float)BH_Y) < ship_r2)
            kill_ship(0);
        if (ship2.active && dist2_wrap(ship2.x, ship2.y, (float)BH_X, (float)BH_Y) < ship_r2)
            kill_ship(1);
    }
    /* 玩家子弹命中 BOSS 扣血(并触发反击) */
    if (g_bossAlive) {
        bullet_r2 = (float)(BH_R + BULLET_R) * (BH_R + BULLET_R);
        for (i = 0; i < BULLET_MAX; i++) {
            if (bullet1[i].active && dist2_wrap(bullet1[i].x, bullet1[i].y, (float)BH_X, (float)BH_Y) < bullet_r2) {
                bullet1[i].active = 0;
                boss_damage(0);
            }
            if (bullet2[i].active && dist2_wrap(bullet2[i].x, bullet2[i].y, (float)BH_X, (float)BH_Y) < bullet_r2) {
                bullet2[i].active = 0;
                boss_damage(1);
            }
        }
    }
    /* BOSS 子弹命中飞船 */
    bullet_r2 = (float)(BOSS_BULLET_R + SHIP_R) * (BOSS_BULLET_R + SHIP_R);
    for (i = 0; i < BOSS_BULLET_MAX; i++) {
        if (!boss_bullets[i].active) continue;
        if (ship1.active && dist2_wrap(boss_bullets[i].x, boss_bullets[i].y, ship1.x, ship1.y) < bullet_r2) {
            boss_bullets[i].active = 0;
            kill_ship(0);
        }
        if (ship2.active && dist2_wrap(boss_bullets[i].x, boss_bullets[i].y, ship2.x, ship2.y) < bullet_r2) {
            boss_bullets[i].active = 0;
            kill_ship(1);
        }
    }
}

void check_collisions(void) {
    float r2, bh_r2, bhr_b;
    unsigned char i;
    /* 彩蛋合作战走独立碰撞规则(友伤关闭, 只打 BOSS) */
    if (g_easterEgg) { check_collisions_boss(); return; }
    bh_r2 = (float)(BH_R+SHIP_R)*(BH_R+SHIP_R);
    bhr_b = (float)(BH_R+BULLET_R)*(BH_R+BULLET_R);
    /* 黑洞吞飞船 */
    if (ship1.active && dist2_wrap(ship1.x, ship1.y, (float)BH_X, (float)BH_Y) < bh_r2)
        kill_ship(0);
    if (ship2.active && dist2_wrap(ship2.x, ship2.y, (float)BH_X, (float)BH_Y) < bh_r2)
        kill_ship(1);
    /* 黑洞吞子弹 */
    for (i = 0; i < BULLET_MAX; i++) {
        if (bullet1[i].active && dist2_wrap(bullet1[i].x, bullet1[i].y, (float)BH_X, (float)BH_Y) < bhr_b)
            bullet1[i].active = 0;
        if (bullet2[i].active && dist2_wrap(bullet2[i].x, bullet2[i].y, (float)BH_X, (float)BH_Y) < bhr_b)
            bullet2[i].active = 0;
    }
    /* 子弹命中飞船 */
    r2 = (float)(SHIP_R+BULLET_R)*(SHIP_R+BULLET_R);
    for (i = 0; i < BULLET_MAX; i++) {
        if (bullet1[i].active && ship2.active && dist2_wrap(bullet1[i].x, bullet1[i].y, ship2.x, ship2.y) < r2) {
            bullet1[i].active = 0;
            kill_ship(1);
        }
        if (bullet2[i].active && ship1.active && dist2_wrap(bullet2[i].x, bullet2[i].y, ship1.x, ship1.y) < r2) {
            bullet2[i].active = 0;
            kill_ship(0);
        }
    }
}

/* ================= 胜负判定 ================= */
void check_winner(void) {
    if (g_state != ST_PLAYING) return;
    if (g_easterEgg) {
        /* 合作战失败: 双方都出局(0 命且不再重生) */
        if (ship1.lives == 0 && ship1.respawn == 0 && ship1.active == 0 &&
            ship2.lives == 0 && ship2.respawn == 0 && ship2.active == 0) {
            g_flags |= FLAG_BOSS_LOSE;
            g_state = ST_GAMEOVER;
            gameover_tick = 200;
            SetBeep(300, 30);
        }
        return;
    }
    if (ship1.lives == 0 && ship1.respawn == 0 && ship1.active == 0) {
        /* P1 判负, P2 胜 */
        p2wins++;
        NVM_Write(1, p2wins);
        g_flags |= 0x08;   /* P2 胜 */
        g_state = ST_GAMEOVER;
        gameover_tick = 200;  /* 2 秒后回菜单 */
        SetBeep(500, 30);
    }
    else if (ship2.lives == 0 && ship2.respawn == 0 && ship2.active == 0) {
        p1wins++;
        NVM_Write(0, p1wins);
        g_flags |= 0x04;   /* P1 胜 */
        g_state = ST_GAMEOVER;
        gameover_tick = 200;
        SetBeep(500, 30);
    }
}

/* ================= 组帧发送 Host->PC ================= */
void send_frame(void) {
    unsigned char sum, i, n;
    uart1_tx[0] = HEAD_PC0;
    uart1_tx[1] = HEAD_PC1;
    uart1_tx[2] = g_state;
    uart1_tx[3] = g_menuSel;
    uart1_tx[4] = (unsigned char)ship1.x;
    uart1_tx[5] = (unsigned char)ship1.y;
    uart1_tx[6] = ship1.ang;
    uart1_tx[7] = ship1.lives;
    uart1_tx[8] = (unsigned char)ship2.x;
    uart1_tx[9] = (unsigned char)ship2.y;
    uart1_tx[10] = ship2.ang;
    uart1_tx[11] = ship2.lives;
    /* P1 子弹 + P2 子弹, 各 BULLET_MAX 组 (active,x,y) */
    n = FRAME_BULLET_BASE;
    for (i = 0; i < BULLET_MAX; i++) {
        uart1_tx[n++] = bullet1[i].active;
        uart1_tx[n++] = (unsigned char)bullet1[i].x;
        uart1_tx[n++] = (unsigned char)bullet1[i].y;
    }
    for (i = 0; i < BULLET_MAX; i++) {
        uart1_tx[n++] = bullet2[i].active;
        uart1_tx[n++] = (unsigned char)bullet2[i].x;
        uart1_tx[n++] = (unsigned char)bullet2[i].y;
    }
    uart1_tx[FRAME_P1WINS] = p1wins;
    uart1_tx[FRAME_P2WINS] = p2wins;
    uart1_tx[FRAME_FLAGS] = g_flags;
    uart1_tx[FRAME_BGMODE] = g_bgMode;
    uart1_tx[FRAME_EASTER] = g_easterEgg;
    uart1_tx[FRAME_BOSS_HP] = g_bossHp;
    n = FRAME_BOSS_BSTART;
    for (i = 0; i < BOSS_BULLET_MAX; i++) {
        uart1_tx[n++] = boss_bullets[i].active;
        uart1_tx[n++] = (unsigned char)boss_bullets[i].x;
        uart1_tx[n++] = (unsigned char)boss_bullets[i].y;
    }
    sum = 0;
    for (i = 0; i < (FRAME_TX_LEN - 1); i++) sum += uart1_tx[i];
    uart1_tx[FRAME_TX_LEN - 1] = sum;
    Uart1Print(uart1_tx, FRAME_TX_LEN);
}

/* ================= 数码管显示胜场 ================= */
void display_wins(void) {
    unsigned char d[8];
    unsigned char i;
    for (i = 0; i < 8; i++) d[i] = 10;  /* 全灭 */
    /* P1 胜场占 3 位 */
    d[0] = p1wins / 100;
    d[1] = (p1wins / 10) % 10;
    d[2] = p1wins % 10;
    /* 中间分隔 */
    d[3] = 12;  /* '-' */
    /* P2 胜场占 3 位 */
    d[4] = p2wins / 100;
    d[5] = (p2wins / 10) % 10;
    d[6] = p2wins % 10;
    d[7] = 10;
    Seg7Print(d[0], d[1], d[2], d[3], d[4], d[5], d[6], d[7]);
}

/* ================= 回调 ================= */
void cb_10ms(void) {
    /* RS485 超时检测 */
    if (rs485_timeout > 0) rs485_timeout--;

